INSERT INTO students (id, student_full_name, student_furigana, student_nickname, email, prefecture, city, age, gender, student_remark, student_is_deleted) VALUES
('1a2b3c4d-0001-0000-0000-000000000001', '山田太郎', 'ヤマダタロウ', 'たろう', 'taro.yamada@example.com', '東京都', '新宿区', 25, '男性', 'Java勉強中', 0),
('1a2b3c4d-0001-0000-0000-000000000002', '佐藤花子', 'サトウハナコ', 'はな', 'hanako.sato@example.com', '大阪府', '大阪市', 28, '女性', 'HTMLが得意', 0),
('1a2b3c4d-0001-0000-0000-000000000003', '鈴木一郎', 'スズキイチロウ', 'いっちー', 'ichiro.suzuki@example.com', '愛知県', '名古屋市', 30, '男性', 'フロントエンド志望', 0),
('1a2b3c4d-0001-0000-0000-000000000004', '高橋美咲', 'タカハシミサキ', 'みさ', 'misaki.takahashi@example.com', '北海道', '札幌市', 23, '女性', 'デザインが好き', 0),
('1a2b3c4d-0001-0000-0000-000000000005', '田中健', 'タナカケン', 'けんけん', 'ken.tanaka@example.com', '福岡県', '福岡市', 27, '男性', 'バックエンド志望', 0);


INSERT INTO students_courses (student_id, course_name, course_start_at, course_end_at) VALUES
('1a2b3c4d-0001-0000-0000-000000000001', 'Javaコース', '2024-04-01 09:00:00', '2024-06-30 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000001', 'AWSコース', '2024-07-01 09:00:00', '2024-09-30 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000002', 'AWSコース', '2024-04-10 09:00:00', '2024-05-31 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000002', 'デザインコース', '2024-06-01 09:00:00', '2024-08-31 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000003', 'ウェブマーケティングコース', '2024-05-01 09:00:00', '2024-09-01 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000004', 'ウェブマーケティングコース', '2024-03-01 09:00:00', '2024-05-30 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000004', 'Javaコース', '2024-06-01 09:00:00', '2024-08-15 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000005', 'Javaコース', '2024-04-01 09:00:00', '2024-06-15 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000005', 'AWSコース', '2024-06-16 09:00:00', '2024-09-30 17:00:00'),
('1a2b3c4d-0001-0000-0000-000000000003', 'AWSコース', '2024-09-01 09:00:00', '2024-11-30 17:00:00');
